In [1]:
import pymysql

In [7]:
mydb=pymysql.connect(
    host='localhost',
    user='root',
    password='Thejerryy2305',
    database='machines'
)
mycursor=mydb.cursor()

In [8]:
mycursor.execute('alter table staffrecords add column staffaddress text not null')

0

In [9]:
mycursor.execute('alter table staffrecords add column staffphonenumber text not null after staffage')

0

In [10]:
mycursor.execute('alter table staffrecords modify column staffphonenumber varchar(11) not null')

0

In [11]:
mycursor.execute('alter table staffrecords change column staffphonenumber staffcontact varchar(11) not null')

0

In [12]:
mycursor.execute('alter table staffrecords drop column staffaddress')

0

In [13]:
mycursor.execute('alter table staffrecords rename to staffdetails')

0

In [22]:
#sql='insert into staffdetails(id,staffname,staffgender,staffage,staffcontact) values(%s,%s,%s,%s,%s)'
#val=[(11,'Ade Henry','Male',35,'09067834567'),
     #(22,'Sasha Banks','Female',30,'09078578536'),
     #(33,'Muhammed Olu','Nonbinary',23,'07085685756')]
#mycursor.executemany(sql,val)
#mydb.commit()

In [24]:
sql='insert into staffdetails(id,staffname,staffgender,staffage,staffcontact) values(%s,%s,%s,%s,%s)'
val=[(1111,'Ade Henry','Male',35,'09067834567'),
     (2222,'Sasha Banks','Female',30,'09078578536'),
     (3333,'Muhammed Olu','Nonbinary',23,'07085685756')]
mycursor.executemany(sql,val)
mydb.commit()

In [25]:
mycursor.execute('select * from staffdetails')
for x in mycursor:
    print(x)

(1, 'Ade Henry', 'Male', 35, '09067834567')
(2, 'Sasha Banks', 'Female', 30, '09078578536')
(3, 'Muhammed Olu', 'Nom-binary', 23, '07085685756')
(11, 'Ade Henry', 'Male', 35, '09067834567')
(22, 'Sasha Banks', 'Female', 30, '09078578536')
(33, 'Muhammed Olu', 'Nonbinary', 23, '07085685756')
(1111, 'Ade Henry', 'Male', 35, '09067834567')
(2222, 'Sasha Banks', 'Female', 30, '09078578536')
(3333, 'Muhammed Olu', 'Nonbinary', 23, '07085685756')

In [28]:
mycursor.execute('update staffdetails set staffage=40 where id=1')
mycursor.execute('select * from staffdetails')
for x in mycursor:
    print(x)

(1, 'Ade Henry', 'Male', 40, '09067834567')
(2, 'Sasha Banks', 'Female', 30, '09078578536')
(3, 'Muhammed Olu', 'Nom-binary', 23, '07085685756')
(11, 'Ade Henry', 'Male', 35, '09067834567')
(22, 'Sasha Banks', 'Female', 30, '09078578536')
(33, 'Muhammed Olu', 'Nonbinary', 23, '07085685756')
(1111, 'Ade Henry', 'Male', 35, '09067834567')
(2222, 'Sasha Banks', 'Female', 30, '09078578536')
(3333, 'Muhammed Olu', 'Nonbinary', 23, '07085685756')

In [30]:
mycursor.execute('delete from staffdetails where id=3333')
mycursor.execute('select * from staffdetails')
for x in mycursor:
    print(x)

(1, 'Ade Henry', 'Male', 40, '09067834567')
(2, 'Sasha Banks', 'Female', 30, '09078578536')
(3, 'Muhammed Olu', 'Nom-binary', 23, '07085685756')
(11, 'Ade Henry', 'Male', 35, '09067834567')
(22, 'Sasha Banks', 'Female', 30, '09078578536')
(33, 'Muhammed Olu', 'Nonbinary', 23, '07085685756')
(1111, 'Ade Henry', 'Male', 35, '09067834567')
(2222, 'Sasha Banks', 'Female', 30, '09078578536')